0/fluid/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    boundSymmetry   
    {
        type            symmetry;
    }

    inlet
    {
        type                flowRateInletVelocity;
        volumetricFlowRate  constant 0.000095;
    }

    fluid_to_solid
    {
	type            mappedValue;
	value		$internalField;
    }
}


// ************************************************************************* //
