0/solid/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{

    atmosphere
    {
        type            totalPressure;
        p0              uniform 0;
        value           uniform 0;
    }

    boundSymmetry
    {
        type            symmetry;
    }

    solid_to_fluid
    {
        type            fixedFluxPressure;
	value		uniform 1e5;
    }
}

// ************************************************************************* //
