constant/fluid/physicalProperties.liquid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties.liquid;
}
// ************************************************************************* //

thermoType 
{     
    type            heRhoThermo;     
    mixture         pureMixture;     
    transport       const;     
    thermo          eConst;     
    equationOfState rhoConst;     
    specie          specie;     
    energy          sensibleInternalEnergy; 
}  

mixture 
{     
    specie     
    {         
        molWeight   55.85;     
    }     
    equationOfState     
    {         
        rho         7300;     
    }     
    thermodynamics     
    {         
        Cv          542.85;         
        Hf          0;     
    }     
    transport     
    {         
    	mu          0.006; 
    	Pr	    0.108;	
    } 
}

// ************************************************************************* //
