constant/fluid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/fluid/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    boundSymmetry
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          452;
        startFace       37554;
    }
    inlet
    {
        type            patch;
        nFaces          400;
        startFace       38006;
    }
    fluid_to_solid
    {
        type            mappedWall;
        inGroups        List<word> 
2
(
wall
mapped
)
;
        nFaces          9654;
        startFace       38406;
        neighbourRegion solid;
        neighbourPatch  solid_to_fluid;
        transformType   none;
    }
)

// ************************************************************************* //
