constant/solid1/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/solid1/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

2
(
    atmosphere
    {
        type            patch;
        nFaces          3;
        startFace       2;
    }
    solid1_to_solid
    {
        type            mappedWall;
        inGroups        List<word> 
2
(
wall
mapped
)
;
        nFaces          11;
        startFace       5;
        neighbourRegion solid;
        neighbourPatch  solid_to_solid1;
        transformType   none;
    }
)

// ************************************************************************* //
