constant/solid3/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/solid3/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

1
(
    solid3_to_solid
    {
        type            mappedWall;
        inGroups        List<word> 
2
(
wall
mapped
)
;
        nFaces          6;
        startFace       0;
        neighbourRegion solid;
        neighbourPatch  solid_to_solid3;
        transformType   none;
    }
)

// ************************************************************************* //
