system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \    /   O peration     | Website:  https://openfoam.org
    \  /    A nd           | Version:  12
     \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    (-0.34834599   0.080392003  -0.097154997) //0
    (-0.12567601   0.080392003  -0.097154997) //1
    (-0.124001327  0.086642005  -0.097154997) //2
    (-0.34834599   0.086642005  -0.097154997) //3
    (-0.34834599   0.40860099   -0.097154997) //4
    (-0.124001327  0.40860099   -0.097154997) //5
    (-0.102350683  0.086642005  -0.097154997) //6
    (-0.102350683  0.40860099   -0.097154997) //7
    ( 0.121994     0.40860099   -0.097154997) //8
    ( 0.121994     0.086642005  -0.097154997) //9
    ( 0.121994     0.080392003  -0.097154997) //10
    (-0.100676     0.080392003  -0.097154997) //11

    (-0.34834599   0.080392003   0.122)//12
    (-0.12567601   0.080392003   0.122)//13
    (-0.124001327  0.086642005   0.122)//14
    (-0.34834599   0.086642005   0.122)//15
    (-0.34834599   0.40860099    0.122)//16
    (-0.124001327  0.40860099    0.122)//17
    (-0.102350683  0.086642005   0.122)//18
    (-0.102350683  0.40860099    0.122)//19
    ( 0.121994     0.40860099    0.122)//20
    ( 0.121994     0.086642005   0.122)//21
    ( 0.121994     0.080392003   0.122)//22
    (-0.100676     0.080392003   0.122)//23
);

blocks
(
    hex (0 1 2 3 12 13 14 15)   (20  5  20) simpleGrading  (1 1 1)
    hex (3 2 5 4 15 14 17 16)   (20 25  20) simpleGrading  (1 1 1)
    hex (2 6 7 5 14 18 19 17)   (5  25  20) simpleGrading  (1 1 1)
    hex (6 9 8 7 18 21 20 19)   (20 25  20) simpleGrading  (1 1 1)
    hex (11 10 9 6 23 22 21 18) (20  5  20)  simpleGrading (1 1 1)
    hex (1 11 6 2 13 23 18 14)  (5   5  20)  simpleGrading (1 1 1)
);

edges
(
    arc 1 2  (-0.125250083 0.083627242 -0.097154997)
    arc 2 6  (-0.113176005 0.092892008 -0.097154997)
    arc 6 11  (-0.101101927 0.083627242 -0.097154997)

    arc 13 14  (-0.125250083 0.083627242  0.122)
    arc 14 18  (-0.113176005 0.092892008  0.122)
    arc 18 23  (-0.101101927 0.083627242  0.122)


);

boundary
(
    atmosphere
    {
        type patch;
        faces
        (
	    (0 3 2 1)
	    (3 4 5 2)
	    (2 5 7 6)
	    (6 7 8 9)
	    (9 10 11 6)
            (1 2 6 11)
	    (12 13 14 15)
	    (15 14 17 16)
	    (14 18 19 17)
	    (18 21 20 19)
            (23 22 21 18)
	    (0 3 15 12)
	    (3 4 16 15)
	    (8 9 21 20)
            (10 22 21 9)
	    (4 5 17 16)
	    (5 7 19 17)
	    (7 8 20 19)
        );
    }
    boundSymmetry
    {
        type symmetry;
        faces
        (
	    (13 1 0 12)
	    (11 1 13 23)
	    (22 10 11 23)
        );
    }
    inlet
    {
        type patch;
	faces
	(
	    (13 23 18 14)
	);
    }
);

mergePatchPairs
(
    // Optional: specify any patch merging if needed
);
